app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-07-03 02:43:19.237953"], ["updated_at", "2019-07-03 02:43:19.237953"]]
---
    def create
        @school_class = SchoolClass.new
        @school_class.update(school_class_params(:title, :room_number))
        @school_class.save